Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L04.tmx
Source language: en_us
Languages: zh_cn

source: The Moonlit Road
zh_cn: 洒满月光的路

source: Statement of Joel Hetman, Jr.
zh_cn: 小乔尔海特曼的陈述

source: I am the most unfortunate of men.
zh_cn: 我是世上最不幸的人。

source: Rich, respected, fairly well educated and of sound health- with many other advantages usually valued by those having them and coveted by those who have them not- I sometimes think that I should be less unhappy if they had been denied me, for then the contrast between my outer and my inner life would not be continually demanding a painful attention.
zh_cn: 家境殷实，受人尊敬，接受过良好的教育，身体健康，还有更多人生的优越条件——拥有者大都十分珍惜，而无缘得到的人也会羡慕不已。可有时我会想，如果这一切都未曾落在我的身上，我也不会像现在这样不开心。因为那样，我的内心和现实生活的反差，不会时刻纠缠在我的心头，让我痛苦不堪。

source: In the stress of privation and the need of effort I might sometimes forget the sombre secret ever baffling the conjecture that it compels.
zh_cn: 贫困给人压力，需要人去努力，也许会让我一时忘记那个郁结不解的秘密，以及因之而生、驱之不去的困惑和猜测。

source: I am the only child of Joel and Julia Hetman.
zh_cn: 我是乔尔·海特曼和茱莉亚·海特曼的独生子。

source: The one was a well-to-do country gentleman, the other a beautiful and accomplished woman to whom he was passionately attached with what I now know to have been a jealous and exacting devotion.
zh_cn: 我的父母，一位是富有的乡绅，一位是美貌多才的女性。父亲深爱着母亲，他的爱是狂热的，充满了对母亲的依恋，后来我还发现，其中夹杂着些许嫉妒和严苛的成分。

source: The family home was a few miles from Nashville, Tennessee, a large, irregularly built dwelling of no particular order of architecture, a little way off the road, in a park of trees and shrubbery.
zh_cn: 我们的家，就坐落在田纳西州纳什维尔镇几英里外一个有很多树木和灌木丛的公园里，房子挺大，形状不太规则，建筑样式也没什么特别之处，与马路隔着一小段距离。

source: At the time of which I write I was nineteen years old, a student at Yale.
zh_cn: 我讲述的这段经历发生在我十九岁那年，当时我正在耶鲁读书。

source: One day I received a telegram from my father of such urgency that in compliance with its unexplained demand I left at once for home.
zh_cn: 一天，我收到父亲一封电报，要我火速回家，没作任何解释。我遵照指示，立即动身。

source: At the railway station in Nashville a distant relative awaited me to apprise me of the reason for my recall: my mother had been barbarously murdered- why and by whom none could conjecture, but the circumstances were these.
zh_cn: 在纳什维尔火车站，一位迎候我的远亲道出其中的原委：我的母亲被人残忍地杀害了——凶手是谁，动机是什么，无从知晓。然而悲剧已经发生，一切都无法挽回了。

source: My father had gone to Nashville, intending to return the next afternoon. Something prevented his accomplishing the business in hand, so he returned on the same night, arriving just before the dawn.
zh_cn: 当时我的父亲去了纳什维尔，他本来打算第二天下午返回，可能是生意上的事耽搁了，到下半夜才赶回家。到家之时，天刚近拂晓。

source: In his testimony before the coroner he explained that having no latchkey and not caring to disturb the sleeping servants, he had, with no clearly defined intention, gone round to the rear of the house. As he turned an angle of the building, he heard a sound as of a door gently closed, and saw in the darkness, indistinctly, the figure of a man, which instantly disappeared among the trees of the lawn.
zh_cn: 在验尸官向他取证时，父亲做了这样解释的：由于没带大门的钥匙，也不在意吵醒熟睡中的仆人，他无意间走到了房子背后，刚转过房子的一处拐角，就听到一个类似房门轻轻关上的声音，黑暗中，他隐隐约约看见一个男子的身影一闪而过，迅速消失在草地上的树丛中。

source: A hasty pursuit and brief search of the grounds in the belief that the trespasser was some one secretly visiting a servant proving fruitless, he entered at the unlocked door and mounted the stairs to my mother's chamber.
zh_cn: 父亲赶紧跟了上去，同时简单查看了一下地面上的痕迹，断定这个闯入者是来秘访某个下人的，未果之后，发现有道门没有上锁，于是溜了进去，爬上楼梯，进入母亲的房间。

source: Its door was open, and stepping into black darkness he fell headlong over some heavy object on the floor.
zh_cn: 母亲房间的门是开着的，这个人摸黑走了进去，其间绊了一跤，头撞在地板上的一个重物上。

source: I may spare myself the details; it was my poor mother, dead of strangulation by human hands!
zh_cn: 细节我不想多说了；我可怜的母亲啊，就这样活活被人掐死了！

source: Nothing had been taken from the house, the servants had heard no sound, and excepting those terrible finger-marks upon the dead woman's throat- dear God! that I might forget them!- no trace of the assassin was ever found.
zh_cn: 房间里的东西一件不少，仆人们也没有听见任何动静。除了印在死去女人喉咙上可怕的指痕（上帝啊，让我尽快忘了这些吧！），凶手没有留下任何蛛丝马迹。

source: I gave up my studies and remained with my father, who, naturally, was greatly changed.
zh_cn: 我放弃了学业，守在父亲身边。

source: Always of a sedate, taciturn disposition, he now fell into so deep a dejection that nothing could hold his attention, yet anything- a footfall, the sudden closing of a door- aroused in him a fitful interest; one might have called it an apprehension.
zh_cn: 他彻底变了一个人，当然，这不难理解。他总是一脸严肃、沉默寡言，动不动就陷入深深的沮丧之中，任何事物——飞来的足球，砰然关上的房门——也只能暂时转移一下他的注意力。

source: At any small surprise of the senses he would start visibly and sometimes turn pale, then relapse into a melancholy apathy deeper than before.
zh_cn: 有人说，这是一种焦虑，每一个细微的感官刺激，都会在他的脸上明显地放大：起初是面色苍白，随后故态复萌，陷入比先前更深、更愁的冷漠之中。

source: I suppose he was what is called a 'nervous wreck.'
zh_cn: 我觉得这就是所谓的“精神崩溃”吧。

source: As to me, I was younger then than now- there is much in that.
zh_cn: 至于我，那时候比现在年轻——这意味着许多。

source: Youth is Gilead, in which is balm for every wound.
zh_cn: 青春是基列地的灵药，可以抚平任何创伤。

source: Ah, that I might again dwell in that enchanted land!
zh_cn: 啊，但愿我还能重新生活在那片迷人的土地上！

source: Unacquainted with grief, I knew not how to appraise my bereavement; I could not rightly estimate the strength of the stroke.
zh_cn: 不知道悲伤，不明白丧亲的痛楚，也不去体味它的打击有多么沉重。

source: One night, a few months after the dreadful event, my father and I walked home from the city.
zh_cn: 那件可怕的事情发生后的几个月，一天夜里，父亲和我从城里往家走。

source: The full moon was about three hours above the eastern horizon; the entire countryside had the solemn stillness of a summer night; our footfalls and the ceaseless song of the katydids were the only sound, aloof.
zh_cn: 东方的地平线上，挂起一轮满月，差不多已三个小时了；整个乡村沉浸在夏夜的静谧之中，唯有我们的脚步声和纺织娘持续不断的鸣叫声，听上去空旷而寂寥。

source: Black shadows of bordering trees lay athwart the road, which, in the short reaches between, gleamed a ghostly white.
zh_cn: 黑魆魆的树影横亘在道路的两旁，短短的树影之间，隐隐闪现出幽灵般的乳白。

source: As we approached the gate to our dwelling, whose front was in shadow, and in which no light shone, my father suddenly stopped and clutched my arm, saying, hardly above his breath: 'God! God! what is that?'
zh_cn: 就在我们即将到达家门的时候，在房子前方，黑暗笼罩、没有一丝光亮的地方，父亲突然停住了脚步，紧紧抓住了我的胳膊，压低了声音说：“天哪，天哪！那是什么？”

source: 'I hear nothing,' I replied.'
zh_cn: “没听到什么动静啊，”我回答。

source: But see- see!' he said, pointing along the road, directly ahead.
zh_cn: “但是你看——看见了吗！”他说，指着路的正前方。

source: I said: 'Nothing is there. Come, father, let us go in- you are ill.'
zh_cn: 我说：“那儿什么都没有啊？走吧，老爸，我们进屋去——你生病了吧。”

source: He had released my arm and was standing rigid and motionless in the centre of the illuminated roadway, staring like one bereft of sense.
zh_cn: 他松开了我的胳膊，僵直地站在明亮路的中间，呆呆地注视着前方，一动不动，像失去了知觉。

source: His face in the moonlight showed a pallor and fixity inexpressibly distressing.
zh_cn: 月色让他的面容显得格外苍白，脸上凝结着一种难以名状的痛楚。

source: I pulled gently at his sleeve, but he had forgotten my existence.
zh_cn: 我轻轻地拉了拉他的袖子，但是他好像忘记了我的存在。

source: Presently he began to retire backward, step by step, never for an instant removing his eyes from what he saw, or thought he saw.
zh_cn: 过了一会儿，他开始往后退，一步，又一步，眼珠紧紧盯着他看到的东西（或者说，他自认为看到的东西）。

source: I turned half round to follow, but stood irresolute.
zh_cn: 我转身想要跟上去，可刚刚转了一半，又犹疑不定地站住了。

source: I do not recall any feeling of fear, unless a sudden chill was its physical manifestation.
zh_cn: 现在回想起来，当时我并没有觉得害怕，只是突然觉得身上一阵发凉，这让我相信确实有什么东西存在。

source: It seemed as if an icy wind had touched my face and enfolded my body from head to foot; I could feel the stir of it in my hair.
zh_cn: 一阵冰凉的风触到我的脸庞，把我从头到脚卷了进去；能够感觉它渗透到每一丝发根。

source: At that moment my attention was drawn to a light that suddenly streamed from an upper window of the house: one of the servants, awakened by what mysterious premonition of evil who can say, and in obedience to an impulse that she was never able to name, had lit a lamp.
zh_cn: 就在那一刻，一束光线突然是从房子上层窗户照射出来，吸引了我注意力。一名仆人——她自己也说不清被什么神秘的凶兆所惊醒，一股莫名的冲动驱使她点亮了灯。

source: When I turned to look for my father he was gone, and in all the years that have passed no whisper of his fate has come across the borderland of conjecture from the realm of the unknown.
zh_cn: 当我回过神，转身寻找父亲的时候，他已经不见了。这么多年过去了，父亲好像消失在一个不可知的领域。关于他命运的消息，丝毫未曾越过我的想象所能触及的边界。

source: Statement of Caspar Grattan
zh_cn: 卡斯伯·戈兰顿的陈述

source: To-day I am said to live, to-morrow, here in this room, will lie a senseless shape of clay that all too long was I.
zh_cn: 今天，他们说，我还活着；明天，就在这间屋子里，将会躺着一尊没有任何知觉的泥塑——那就是我，很久以来的我。

source: If anyone lift the cloth from the face of that unpleasant thing it will be in gratification of a mere morbid curiosity.
zh_cn: 这件令人厌恶的物品，如果有人将盖在它脸上的布掀开，某种病态的好奇心将会得到满足。

source: Some, doubtless, will go further and inquire, 'Who was he?'
zh_cn: 接下来，毫无疑问，有人会问：“他是谁？”

source: In this writing I supply the only answer that I am able to make- Caspar Grattan.
zh_cn: 在这篇文字中，我唯一可以给出的答案就是：卡斯伯·戈兰顿。

source: Surely, that should be enough.
zh_cn: 是的，这就足够了。

source: The name has served my small need for more than twenty years of a life of unknown length.
zh_cn: 在我二十多年陌生的生命之中，这个名字满足了我一个小小的需求。

source: True, I gave it to myself, but lacking another I had the right.
zh_cn: 是的，我给了自己这个名字，但失去了另一个我有权拥有的名字。

source: In this world one must have a name; it prevents confusion, even when it does not establish identity.
zh_cn: 也许，在这个世界上，为了避免引起混乱，人必须有一个名字，尽管有时名字也无法证明一个人的身份。

source: Some, though, are known by numbers, which also seem inadequate distinctions.
zh_cn: 有时候知道一个人的存在，一个数字就足够了；然而这似乎也不足以将人区分开来。

source: One day, for illustration, I was passing along a street of a city, far from here, when I met two men in uniform, one of whom, half pausing and looking curiously into my face, said to his companion, 'That man looks like 767.'
zh_cn: 比如说，有一天，我从某个城市的街道上走过（这座城市离这儿很远），偶然遇到两个穿制服的人。其中一个人放缓脚步，好奇地打量我的脸，对他的同伴说：“那个人很像767号。”

source: Something in the number seemed familiar and horrible.
zh_cn: 数字里隐含的某些东西，似乎很熟悉，也很可怕。

source: Moved by an uncontrollable impulse, I sprang into a side street and ran until I fell exhausted in a country lane.
zh_cn: 在一股难以克制的冲动驱使下，我撒腿就跑，冲进街旁的一条小巷，一直跑到乡村的一条小路上，筋疲力尽，瘫倒在地。

source: I have never forgotten that number, and always it comes to memory attended by gibbering obscenity, peals of joyless laughter, the clang of iron doors.
zh_cn: 我一直没有忘记那个号码。它总是在我的记忆里出现，随之而来的，是一些含混不清的污言秽语、阵阵令人讨厌的笑声，以及铁门发出的咣当声。

source: So I say a name, even if self-bestowed, is better than a number.
zh_cn: 所以我说，一个名字，哪怕是自己起的，也比一个数字要好。

source: In the register of the potter's field I shall soon have both.
zh_cn: 快了，快了——在陶艺匠的注名册上，我很快两者都能拥有。

source: What wealth!
zh_cn: 这是多么巨大的一笔财富啊！

source: Of him who shall find this paper I must beg a little consideration. It is not the history of my life; the knowledge to write that is denied me.
zh_cn: 诸位看官，在阅读这篇文字之前，务必请你们稍稍注意一点：这不是我个人的生活史，我没有这个能耐写下这样的文字。

source: This is only a record of broken and apparently unrelated memories, some of them as distinct and sequent as brilliant beads upon a thread, others remote and strange, having the character of crimson dreams with interspaces blank and black- witch-fires glowing still and red in a great desolation.
zh_cn: 这些只是对一些支离破碎、看似互不相关的记忆所作的记录：有些记忆非常清晰，非常连贯，像丝线串起的璀璨的珠子；另一些则非常遥远，非常奇怪，如同一个深红色的梦，梦中留下了一些黑白相间的空隙——荒凉的土地上，巫火在静静地燃烧，呈现一片火一般的红色。

source: Standing upon the shore of eternity, I turn for a last look landward over the course by which I came.
zh_cn: 我站在来世的水岸，转身，最后一次眺望今生走过的陆地。

source: There are twenty years of footprints fairly distinct, the impressions of bleeding feet. They lead through poverty and pain, devious and unsure, as of one staggering beneath a burden-
zh_cn: 二十年，足迹依然非常清晰，那是一道血淋淋的印记，它通向的是贫穷和痛苦、曲折和迷茫，像一个人背负沉重压力，步履蹒跚——

source: Remote, unfriended, melancholy, slow.
zh_cn: 遥远，无依，忧伤，迟缓。

source: Ah, the poet's prophecy of Me- how admirable, how dreadfully admirable!
zh_cn: 啊，我有了诗人的预言——多么美好，多么值得赞美！

source: Backward beyond the beginning of this via dolorosa- this epic of suffering with episodes of sin- I see nothing clearly; it comes out of a cloud.
zh_cn: 更远处，人生苦旅的伊始——痛苦的史诗和罪恶的章节——我什么也看不清晰；它们从乌云中走来。

source: I know that it spans only twenty years, yet I am an old man.
zh_cn: 我只知道，那个时间的跨度只有短短的二十年。之后我耄耋老去。

source: One does not remember one's birth- one has to be told.
zh_cn: 人不能记得自己出生时的情形，只能依靠别人来告诉他。

source: But with me it was different; life came to me full-handed and dowered me with all my faculties and powers.
zh_cn: 但我有所不同。从出生那一刻起，上帝就赋予我一切应有的才能和力量。

source: Of a previous existence I know no more than others, for all have stammering intimations that may be memories and may be dreams.
zh_cn: 但像所有人一样，对于前世，我知之甚少，只得到过一些零零碎碎的暗示——也许是记忆，也许是梦境。

source: I know only that my first consciousness was of maturity in body and mind- a consciousness accepted without surprise or conjecture.
zh_cn: 我只知道，我最初的意识来自肉体和精神上的成熟。当我接受它们时候，没有任何惊讶和猜测。

source: I merely found myself walking in a forest, half-clad, footsore, unutterably weary and hungry.
zh_cn: 我发现自己一直在一座森林里行走，衣衫褴褛，脚上有伤，疲惫不堪，饥肠辘辘。

source: Seeing a farmhouse, I approached and asked for food, which was given me by one who inquired my name.
zh_cn: 我看到了一家农舍，于是走了上去，乞讨食物；向我施舍的人询问我的名字。

source: I did not know, yet knew that all had names.
zh_cn: 我不知道自己的名字，虽然我心里清楚，人人都有一个名字。

source: Greatly embarrassed, I retreated, and night coming on, lay down in the forest and slept.
zh_cn: 我羞愧难当，赶忙离去。夜幕降临之时，我躺在森林里，睡着了。

source: The next day I entered a large town which I shall not name.
zh_cn: 第二天，我来到一个很大的城镇，我不愿提起它的名字。

source: Nor shall I recount further incidents of the life that is now to end- a life of wandering, always and everywhere haunted by an overmastering sense of crime in punishment of wrong and of terror in punishment of crime.
zh_cn: 现在，在我的生命即将走向终点之时，我不愿过多讲述过去的那些事情——流浪的生活，压抑不住的罪恶感，惩罚；犯下的错误，对惩罚的恐惧，无论何时何地，它们总在我脑海中出没。

source: Let me see if I can reduce it to narrative.
zh_cn: 让我静一静，看能不能慢慢地讲出来。

source: I seem once to have lived near a great city, a prosperous planter, married to a woman whom I loved and distrusted.
zh_cn: 好像......我曾经居住的地方，在一座大城市的边缘，很大的庄园，富有的庄园主，娶了我爱的女人为妻，可这个女人不太让我放心。

source: We had, it sometimes seems, one child, a youth of brilliant parts and promise.
zh_cn: 又好像......我们有了孩子，年轻，阳光灿烂，美满和向往......

source: He is at all times a vague figure, never clearly drawn, frequently altogether out of the picture.
zh_cn: 可画面里他的身影常常是模模糊糊，未曾清晰地勾勒出来，而且似乎总与这个画面格格不入。

source: One luckless evening it occurred to me to test my wife's fidelity in a vulgar, commonplace way familiar to everyone who has acquaintance with the literature of fact and fiction.
zh_cn: 那个不幸的夜晚，我忽然想考验一下妻子的忠诚。于是我使用了最粗俗、最普通的方法（这种方法常见于文学作品，无论写实还是虚构的，人人耳熟能详）。

source: I went to the city, telling my wife that I should be absent until the following afternoon.
zh_cn: 我告诉妻子，我要去城里，第二天下午才能回来。

source: But I returned before daybreak and went to the rear of the house, purposing to enter by a door with which I had secretly so tampered that it would seem to lock, yet not actually fasten.
zh_cn: 但第二天，天还没亮我就回来了。我悄悄绕到房子的后面，打算从后门进屋。这道门事先被我偷偷做了手脚，看上去像锁上了，其实并没有锁。

source: As I approached it, I heard it gently open and close, and saw a man steal away into the darkness. With murder in my heart, I sprang after him, but he had vanished without even the bad luck of identification.
zh_cn: 当我接近房门的时候，我听到它被轻轻打开，然后又轻轻关上了，我看到一个男人偷偷溜出来，消失在黑暗之中。糟糕的是，我根本来不及辨认这个人的身份。

source: Sometimes now I cannot even persuade myself that it was a human being.
zh_cn: 至今我都无法说服自己，那个黑影到底是不是一个人。

source: Crazed with jealousy and rage, blind and bestial with all the elemental passions of insulted manhood, I entered the house and sprang up the stairs to the door of my wife's chamber.
zh_cn: 疯狂、嫉妒、愤怒，一个男人受到侮辱时所有的感受，如潮水般涌上我的心头，蒙住了我的双眼。我像一头疯了的野兽，不顾一切地冲进屋子，跃上楼梯，来到我妻子卧室的门前。

source: It was closed, but having tampered with its lock also, I easily entered, and despite the black darkness soon stood by the side of her bed.
zh_cn: 门是关着的，可门上的锁也被我做过手脚，轻而易举就打开了。我进了房间。尽管屋里一片漆黑，但很快我就站到她的床前。

source: My groping hands told me that although disarranged it was unoccupied.
zh_cn: 我用手摸索起来，发现床铺虽然很乱，但她并不在床上。

source: 'She is below,' I thought, 'and terrified by my entrance has evaded me in the darkness of the hall.'
zh_cn: “她下楼了，”我想，“被我的出现吓坏了，躲到楼下大厅里去了？!”

source: With the purpose of seeking her I turned to leave the room, but took a wrong direction- the right one!
zh_cn: 我转身离开房间，想去找她，但是走错了方向——却是一个正确的方向！

source: My foot struck her, cowering in a corner of the room.
zh_cn: 我的脚绊到她身上！她蜷缩在房间的角落里，浑身发抖。

source: Instantly my hands were at her throat, stifling a shriek, my knees were upon her struggling body; and there in the darkness, without a word of accusation or reproach, I strangled her till she died!
zh_cn: 顷刻间，我的双手扼住了她的喉咙。她的尖叫因窒息而显得沉闷，我的双膝死死顶住了她挣扎的躯体；在那个地方，在黑暗中，没来得及说出一句责备或谴责的话，我紧紧掐住了她的脖子，直到她断了气。
